app/views/questions/show.html.erb


<% if @question.answers.count == 0 then %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]