app/views/likes/_like.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]
---
          <span>
             <%= post.likes.count %>