app/views/questionaries/show.html.erb

SELECT "questionary_items".* FROM "questionary_items" WHERE "questionary_items"."questionary_id" = ?  [["questionary_id", 3]]
---

  <% @questionary.questionary_items.each do |item| %>