app/views/posts/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]
---
        <td><%= post.title %></td>
        <td><%= post.content %>   <small><i class="fa fa-heart fa-fw"></i>いいね！ <%= post.likes.count %>件</small></td>