app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "content", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 1], ["content", "一応、8/13～8/15だと思います。"], ["name", "Hanako"], ["created_at", "2018-08-09 23:38:12.030069"], ["updated_at", "2018-08-09 23:38:12.030069"]]
SELECT COUNT(*) FROM "answers" WHERE (question_id = 2)
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "finished" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["finished", "t"], ["updated_at", "2018-08-11 13:01:48.952460"], ["id", 2]]
---
  def create
      end_counter = 10 #終了にする回答数
      @answer = Answer.new(answer_params)
      respond_to do |format|
        if @answer.save
          num = Answer.where('question_id = ?',@answer.question_id).count
            if num >= end_counter then
              q = Question.find @answer.question_id
              q.finished = true
              q.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_answer
      @answer = Answer.find(params[:id])