app/controllers/blogconfigs_controller.rb

SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @blogconfig = Blogconfig.find 1

SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogconfigs" SET "subtitle" = ?, "updated_at" = ? WHERE "blogconfigs"."id" = ?  [["subtitle", "my ideassss"], ["updated_at", "2018-08-02 07:11:55.478040"], ["id", 1]]
---
  def edit
    @blogconfig = Blogconfig.find 1
    if request.patch? then
      @blogconfig.update blogconfig_params