app/controllers/blogposts_controller.rb

  def index
    @data = Blogpost.all.order('created_at desc')
---
SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc

  def add
    @blogpost = Blogpost.new
    @genres = Bloggenre.all
    if request.post? then
      @blogpost = Blogpost.create(blogpost_params)
---
SELECT "bloggenres".* FROM "bloggenres"
INSERT INTO "blogposts" ("title", "read", "content", "bloggenre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "AAA"], ["read", "AAAAA"], ["content", "AAAAAAAAAAAAAAA"], ["bloggenre_id", 1], ["created_at", "2018-08-02 12:22:55.931029"], ["updated_at", "2018-08-02 12:22:55.931029"]]

  def edit
    @blogpost = Blogpost.find params[:id]
    @genres = Bloggenre.all
    if request.patch? then
      @blogpost.update blogpost_params
---
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bloggenres".* FROM "bloggenres"
UPDATE "blogposts" SET "title" = ?, "read" = ?, "content" = ?, "updated_at" = ? WHERE "blogposts"."id" = ?  [["title", "テーマパークを！"], ["read", "各地振興テーマパーク"], ["content", "老若男女楽しめるテーマパークは、地域活性化にもばっちり。"], ["updated_at", "2018-08-03 12:15:05.712997"], ["id", 1]]

  def delete
    @blogpost = Blogpost.find(params[:id])
    if request.post? then
      @blogpost.destroy
---
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogposts" WHERE "blogposts"."id" = ?  [["id", 2]]