app/controllers/bloggenres_controller.rb

SELECT "bloggenres".* FROM "bloggenres"
---
  def index
    @data = Bloggenre.all

INSERT INTO "bloggenres" ("name", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "観光・地方活性化"], ["memo", "観光推進や地方産業の発展について"], ["created_at", "2018-08-02 12:20:30.749163"], ["updated_at", "2018-08-02 12:20:30.749163"]]
---
  def add
    @bloggenre = Bloggenre.new
    if request.post? then
      @bloggenre = Bloggenre.create(bloggenre_params)

SELECT  "bloggenres".* FROM "bloggenres" WHERE "bloggenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bloggenres" SET "name" = ?, "memo" = ?, "updated_at" = ? WHERE "bloggenres"."id" = ?  [["name", "災害時　対策"], ["memo", "災害Map（災害前準備・災害後対策・避難所・給水所・入浴所）"], ["updated_at", "2018-08-03 23:19:05.557493"], ["id", 4]]
---
  def edit
    @bloggenre = Bloggenre.find params[:id]
    if request.patch? then
      @bloggenre.update bloggenre_params