app/controllers/board_messages_controller.rb

SELECT  "board_messages".* FROM "board_messages" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
INSERT INTO "board_users" ("nickname", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nickname", "<< no name >>"], ["account_id", 3], ["created_at", "2018-08-24 00:52:10.187751"], ["updated_at", "2018-08-24 00:52:10.187751"]]
---
  def index
    @board_messages = BoardMessage.page(params[:page]).order('created_at desc')
    users = BoardUser.where 'account_id == ?', current_account.id
    if users[0] == nil then
         user = BoardUser.new
         user.account_id = current_account.id
         user.nickname = '<< no name >>'

SELECT  "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "board_messages" ("content", "board_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "最近、沖縄に行きました。とてもよかったです。"], ["board_user_id", 1], ["created_at", "2018-08-21 06:17:19.152048"], ["updated_at", "2018-08-21 06:17:19.152048"]]
---
  def create
    @board_messages = BoardMessage.page(params[:page]).order('created_at desc')
    @board_message = BoardMessage.new(board_message_params)
    @board_user = BoardUser.where('account_id == ?', current_account.id)[0]
    respond_to do |format|
      if @board_message.save