app/controllers/board_users_controller.rb

SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
INSERT INTO "board_users" ("nickname", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nickname", "<< no name >>"], ["account_id", 1], ["created_at", "2018-08-21 06:11:00.726233"], ["updated_at", "2018-08-21 06:11:00.726233"]]
---
  def index
    users = BoardUser.where 'account_id == ?', current_account.id
    if users[0] == nil then
         user = BoardUser.new
         user.account_id = current_account.id
         user.nickname = '<< no name >>'

SELECT  "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @board_user = BoardUser.find params[:id]

UPDATE "board_users" SET "nickname" = ?, "memo" = ?, "updated_at" = ? WHERE "board_users"."id" = ?  [["nickname", "AAA"], ["memo", "趣味は旅行です。旅行に興味があります。"], ["updated_at", "2018-08-21 06:14:54.291974"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @board_user.update(board_user_params)

SELECT  "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_board_user
      @board_user = BoardUser.find(params[:id])