app/controllers/likes_controller.rb

  def create
     @like = Like.create(user_id: current_account.id, post_id: params[:post_id])
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 4], ["created_at", "2018-10-15 00:28:13.575395"], ["updated_at", "2018-10-15 00:28:13.575395"]]

    def set_post
      @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]