app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE (account_id == 4)
INSERT INTO "users" ("sitename", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sitename", "<< no name >>"], ["account_id", 4], ["created_at", "2018-08-25 02:20:51.363077"], ["updated_at", "2018-08-25 02:20:51.363077"]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 4], ["user_id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]
---
  def index
    @posts = Post.page(params[:page]).order('created_at desc')
    users = User.where 'account_id == ?', current_account.id
    if users[0] == nil then
         user = User.new
         user.account_id = current_account.id
         user.sitename = '<< no name >>'
         user.save
         users = User.where 'account_id == ?', current_account.id
    end
    @user = users[0]
    @post = Post.new
    @post.user_id = @user.id
    #@like = current_user.likes.find_by(post_id: @post.id) if user_signed_in?
    @like = current_account.likes.find_by(post_id: @post.id)

SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @posts = Post.page(params[:page]).order('created_at desc')
    @post = Post.new(post_params)
    @user = User.where('account_id == ?', current_account.id)[0]
    respond_to do |format|
      if @post.save