app/controllers/questionary_items_controller.rb

  def index
    @questionary_items = QuestionaryItem.all
---
SELECT "questionary_items".* FROM "questionary_items"

  def create
    @questionary_item = QuestionaryItem.new(questionary_item_params)

    respond_to do |format|
      if @questionary_item.save
---
INSERT INTO "questionary_items" ("content", "questionary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "朝昼晩と３食ちゃんと食事をしていますか？"], ["questionary_id", 1], ["created_at", "2018-08-14 06:01:40.151343"], ["updated_at", "2018-08-14 06:01:40.151343"]]

    def set_questionary_item
      @questionary_item = QuestionaryItem.find(params[:id])
---
SELECT  "questionary_items".* FROM "questionary_items" WHERE "questionary_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]