app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order created_at: :desc
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "name", "finished", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]