app/controllers/questionary_results_controller.rb

SELECT "questionaries".* FROM "questionaries"
---
  def index
    @questionaries = Questionary.all

SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questionary_results".* FROM "questionary_results" WHERE (questionary_id = '1')
---
  def show
    @questionary = Questionary.find params[:id]
    @questionary_results = QuestionaryResult.where('questionary_id = ?',params[:id])

SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questionary_results".* FROM "questionary_results" WHERE (questionary_id = '1')
---
  def calc
    @questionary = Questionary.find params[:id]
    results = QuestionaryResult.where('questionary_id = ?',params[:id])

SELECT  "questionary_results".* FROM "questionary_results" WHERE "questionary_results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_questionary_result
      @questionary_result = QuestionaryResult.find(params[:id])