app/controllers/questionary_choices_controller.rb

SELECT "questionary_choices".* FROM "questionary_choices"
---
  def index
    @questionary_choices = QuestionaryChoice.all

SELECT  "questionary_items".* FROM "questionary_items" WHERE "questionary_items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @questionary_choice = QuestionaryChoice.new
    @questionary_choice.questionary_item_id = params[:id]
    @questionary_item = QuestionaryItem.find params[:id]

INSERT INTO "questionary_choices" ("content", "value", "questionary_item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "毎日、3食ちゃんと食べている。"], ["value", 1], ["questionary_item_id", 1], ["created_at", "2018-08-14 06:03:52.081996"], ["updated_at", "2018-08-14 06:03:52.081996"]]
---
  def create
    @questionary_choice = QuestionaryChoice.new(questionary_choice_params)

    respond_to do |format|
      if @questionary_choice.save

SELECT  "questionary_choices".* FROM "questionary_choices" WHERE "questionary_choices"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_questionary_choice
      @questionary_choice = QuestionaryChoice.find(params[:id])