app/controllers/questionaries_controller.rb

SELECT "questionaries".* FROM "questionaries" ORDER BY created_at desc
---
  def index
    @questionaries = Questionary.all.order('created_at desc')

INSERT INTO "questionary_results" ("questionary_id", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def sendform
    id = params[:id]
    result = 'question_id:' + id
    for i in 1..100
      str = 'r' + i.to_s
      if params[str] == nil then
           result += ',' + str + ':0'
      else
           result += ',' + str + ':' + params[str]
      end
    end
    obj = QuestionaryResult.new
    obj.questionary_id = id
    obj.result = result
    obj.save!

INSERT INTO "questionaries" ("title", "description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @questionary = Questionary.new(questionary_params)

    respond_to do |format|
      if @questionary.save

SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_questionary
      @questionary = Questionary.find(params[:id])