app/controllers/users_controller.rb

  def index
    users = User.where 'account_id == ?', current_account.id
---
SELECT "users".* FROM "users" WHERE (account_id == 4)

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "sitename" = ?, "intro" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["sitename", "Yoko"], ["intro", "もっといろいろ便利になったらいいな。旅行が好きです。"], ["updated_at", "2018-08-25 02:27:30.909004"], ["id", 1]]